In [29]:
import pandas as pd
import numpy as np

In [30]:
df = pd.DataFrame([[1, 2, 3, 4], [5, 6, 7, 8], [9, 10, 11, 12], [2, 4, 6, 8]], columns=['A', 'B', 'C', 'D'])
df

   A   B   C   D
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12
3  2   4   6   8

# Arthimatic Operations On DataFrame

In [31]:
df + 2

    A   B   C   D
0   3   4   5   6
1   7   8   9  10
2  11  12  13  14
3   4   6   8  10

In [32]:
df

   A   B   C   D
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12
3  2   4   6   8

In [33]:
df - 2

   A  B  C   D
0 -1  0  1   2
1  3  4  5   6
2  7  8  9  10
3  0  2  4   6

In [34]:
df * 2

    A   B   C   D
0   2   4   6   8
1  10  12  14  16
2  18  20  22  24
3   4   8  12  16

In [35]:
df / 2

     A    B    C    D
0  0.5  1.0  1.5  2.0
1  2.5  3.0  3.5  4.0
2  4.5  5.0  5.5  6.0
3  1.0  2.0  3.0  4.0

In [36]:
df - df.iloc[0]

   A  B  C  D
0  0  0  0  0
1  4  4  4  4
2  8  8  8  8
3  1  2  3  4

In [37]:
df[0:2][['C', 'D']]

   C  D
0  3  4
1  7  8

In [38]:
df - df[0:2][['C', 'D']]

    A   B    C    D
0 NaN NaN  0.0  0.0
1 NaN NaN  0.0  0.0
2 NaN NaN  NaN  NaN
3 NaN NaN  NaN  NaN

In [39]:
a_col = df['A']
a_col

0    1
1    5
2    9
3    2
Name: A, dtype: int64

In [13]:
df

   A   B   C   D
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12
3  2   4   6   8

In [14]:
df - a_col #Pandas do row subtraction by default.So, We get NaN's

    A   B   C   D   0   1   2   3
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN

In [15]:
df.sub(a_col, axis=0) #axis=0 means columns

   A  B  C  D
0  0  1  2  3
1  0  1  2  3
2  0  1  2  3
3  0  2  4  6

In [16]:
df

   A   B   C   D
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12
3  2   4   6   8

In [19]:
s1 = pd.Series([0, 1, 2], index = [0, 1, 2])
s2 = pd.Series([2, 3, 4], index = ['0', '1', '2'])

In [20]:
s1 + s2 #Pandas do alignment first, as the string index 0 is not same as the int index 0.

0   NaN
1   NaN
2   NaN
0   NaN
1   NaN
2   NaN
dtype: float64

# How to change the datatype of series indexes?

In [21]:
s2.index = s2.index.values.astype(int)

In [22]:
#Now
s1 + s2

0    2
1    4
2    6
dtype: int64

# ffill and bfill method & Reindexing

In [23]:
s3 = pd.Series(['blue', 'red', 'green'], index = [0, 3, 5])

In [24]:
s3

0     blue
3      red
5    green
dtype: object

In [25]:
s3.reindex([0, 1, 2, 3, 4, 5, 6])

0     blue
1      NaN
2      NaN
3      red
4      NaN
5    green
6      NaN
dtype: object

In [26]:
#if we don't want NaN for missing values
s3.reindex([0 ,1, 2, 3, 4, 5, 6], method="ffill")

0     blue
1     blue
2     blue
3      red
4      red
5    green
6    green
dtype: object

In [27]:
s3.reindex([0 ,1, 2, 3, 4, 5, 6], method="bfill")

0     blue
1      red
2      red
3      red
4    green
5    green
6      NaN
dtype: object

In [28]:
#if we want numbers for missing values instead of NaN
s3.reindex([0 ,1, 2, 3, 4, 5, 6], fill_value=0)

0     blue
1        0
2        0
3      red
4        0
5    green
6        0
dtype: object